Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateOneOrMoreBaluster Property
 Can't create one or more Balusters
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateOneOrMoreBaluster { get; }
Public Shared ReadOnly Property CannotCreateOneOrMoreBaluster As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateOneOrMoreBaluster {
	FailureDefinitionId^ get ();
}
static member CannotCreateOneOrMoreBaluster : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace